Tekla.Structures.Drawing.ContainerView
The ContainerView class contains container views that contain other drawing objects, including other views and container views. The drawing sheet is a container view.
Container views do not contain drawing representations of model objects.
The following example uses a container view to create and insert a new view to the active drawing. A drawing must be open when executing code.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
Drawing Drawing = MyDrawingHandler.GetActiveDrawing();
CoordinateSystem CoordinateSystem = new CoordinateSystem(new Point(), new Vector(1, 0, 0), new Vector(0, 1, 0));
ContainerView ContainerView = Drawing.GetSheet();
View newView = new View(ContainerView, CoordinateSystem, CoordinateSystem, new AABB(new Point(0, 0), new Point(1000, 1000, 1000)));
newView.Insert();
}
}
}

Tekla.Structures.Drawing.ContainerView.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.ContainerView.GetViews
Gets all the views that are placed on the container view.
Returns: The views that are placed on the container view.

Tekla.Structures.Drawing.ContainerView.GetAllViews
Gets all the views that are placed on the container view and their children views.
Returns: The views that are placed on the container view and their children views.